week20_hw/tweeter_app_api/app/controllers/tweets_controller.rb

    def index
        tweet = Tweet.all
---
SELECT "tweets".* FROM "tweets"

    def show
        found_tweet = Tweet.find(params[:id])
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        tweet = Tweet.find(params[:id])
        tweet.update(tweet_params)
---
SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "tweets" SET "author" = $1 WHERE "tweets"."id" = $2  [["author", "armando"], ["id", 3]]